Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["POST_SURVEY_BOT_CHAT_URL"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
        id             = "PROD_TWILIO_ZW_POST_SURVEY_BOT_CHAT_URL"
      + insecure_value = (known after apply)
        name           = (sensitive value)
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_post_survey_bot_chat_url[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_post_survey_bot_chat_url" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/post_survey_bot_chat_url"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/post_survey_bot_chat_url"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/post_survey_bot_chat_url"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.channel.twilio_flex_flex_flows_v1.channel_flow["facebook"] will be updated in-place
  ~ resource "twilio_flex_flex_flows_v1" "channel_flow" {
      ~ friendly_name           = "Flex Facebook Channel Flow" -> "Flex Facebook Flow"
        id                      = "FO4e08e40ac9d3b460168ac91a17f9d7b3"
        # (10 unchanged attributes hidden)
    }

  # module.channel.twilio_flex_flex_flows_v1.channel_flow["webchat"] will be updated in-place
  ~ resource "twilio_flex_flex_flows_v1" "channel_flow" {
      ~ friendly_name           = "Flex Webchat Channel Flow" -> "Flex Webchat Flow"
        id                      = "FOf0ff4dba8eb26addc857aed43a195681"
        # (9 unchanged attributes hidden)
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["facebook"] will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_studio_flow" {
      ~ definition     = jsonencode(
            {
              - description   = "Facebook Messaging Flow"
              - flags         = {
                  - allow_concurrent_calls = true
                }
              - initial_state = "Trigger"
              - states        = [
                  - {
                      - name        = "Trigger"
                      - properties  = {
                          - offset = {
                              - x = -90
                              - y = -90
                            }
                        }
                      - transitions = [
                          - {
                              - event = "incomingMessage"
                              - next  = "split_web"
                            },
                          - {
                              - event = "incomingCall"
                            },
                          - {
                              - event = "incomingConversationMessage"
                            },
                          - {
                              - event = "incomingRequest"
                            },
                          - {
                              - event = "incomingParent"
                            },
                        ]
                      - type        = "trigger"
                    },
                  - {
                      - name        = "attributes_web"
                      - properties  = {
                          - attributes = <<-EOT
                                {
                                  "name": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{trigger.message.ChannelAttributes.memory | to_json}}
                                }
                            EOT
                          - channel    = "TC3d70bb1c3013fff22a5c05fcd330d46a"
                          - offset     = {
                              - x = 700
                              - y = 340
                            }
                          - workflow   = "WW3718e0ead07d771e5e3ab23f8a389152"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                              - next  = "welcome_message"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "welcome_message"
                      - properties  = {
                          - body    = "Thank you for contacting Childline Zimbabwe, a counsellor will be with you shortly. If this is an emergency or you wait longer than 30 min, we recommend you call us for free at 116."
                          - channel = "{{trigger.message.ChannelSid}}"
                          - from    = "Bot"
                          - offset  = {
                              - x = 710
                              - y = 590
                            }
                          - service = "{{trigger.message.InstanceSid}}"
                          - to      = "{{contact.channel.address}}"
                        }
                      - transitions = [
                          - {
                              - event = "sent"
                            },
                          - {
                              - event = "failed"
                            },
                        ]
                      - type        = "send-message"
                    },
                  - {
                      - name        = "split_web"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.channel_type}}"
                          - offset = {
                              - x = 230
                              - y = 110
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "attributes_facebook"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to web"
                                      - type          = "equal_to"
                                      - value         = "web"
                                    },
                                ]
                              - event      = "match"
                              - next       = "attributes_web"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "attributes_facebook"
                      - properties  = {
                          - attributes = <<-EOT
                                {
                                  "name": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{trigger.message.ChannelAttributes.memory | to_json}}
                                }
                            EOT
                          - channel    = "TC3d70bb1c3013fff22a5c05fcd330d46a"
                          - offset     = {
                              - x = 90
                              - y = 400
                            }
                          - workflow   = "WW3718e0ead07d771e5e3ab23f8a389152"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                ]
            }
        ) -> (known after apply)
      ~ friendly_name  = "Facebook Messaging Flow" -> "Facebook Studio Flow"
        id             = "FWbad2896782ceb4df7af16ba43212154c"
        # (3 unchanged attributes hidden)
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["webchat"] will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_studio_flow" {
      ~ definition    = jsonencode(
            {
              - description   = "Webchat Messaging Flow"
              - flags         = {
                  - allow_concurrent_calls = true
                }
              - initial_state = "Trigger"
              - states        = [
                  - {
                      - name        = "Trigger"
                      - properties  = {
                          - offset = {
                              - x = -90
                              - y = -90
                            }
                        }
                      - transitions = [
                          - {
                              - event = "incomingMessage"
                              - next  = "split_web"
                            },
                          - {
                              - event = "incomingCall"
                            },
                          - {
                              - event = "incomingConversationMessage"
                            },
                          - {
                              - event = "incomingRequest"
                            },
                          - {
                              - event = "incomingParent"
                            },
                        ]
                      - type        = "trigger"
                    },
                  - {
                      - name        = "attributes_web"
                      - properties  = {
                          - attributes = <<-EOT
                                {
                                  "ip": "{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}",
                                  "firstName": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "helpline": "{{trigger.message.ChannelAttributes.pre_engagement_data.helpline}}",
                                  "language":"en-US",
                                  "ignoreAgent": "",
                                  "transferTargetType": "",
                                  "preEngagementData": {{trigger.message.ChannelAttributes.pre_engagement_data | to_json}},
                                  "memory": {{trigger.message.ChannelAttributes.memory | to_json}}
                                }
                            EOT
                          - channel    = "TC3d70bb1c3013fff22a5c05fcd330d46a"
                          - offset     = {
                              - x = 700
                              - y = 340
                            }
                          - workflow   = "WW3718e0ead07d771e5e3ab23f8a389152"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                              - next  = "welcome_message"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "welcome_message"
                      - properties  = {
                          - body    = "Thank you for contacting Childline Zimbabwe, a counsellor will be with you shortly. If this is an emergency or you wait longer than 30 min, we recommend you call us for free at 116."
                          - channel = "{{trigger.message.ChannelSid}}"
                          - from    = "Bot"
                          - offset  = {
                              - x = 710
                              - y = 590
                            }
                          - service = "{{trigger.message.InstanceSid}}"
                          - to      = "{{contact.channel.address}}"
                        }
                      - transitions = [
                          - {
                              - event = "sent"
                            },
                          - {
                              - event = "failed"
                            },
                        ]
                      - type        = "send-message"
                    },
                  - {
                      - name        = "split_web"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.channel_type}}"
                          - offset = {
                              - x = 230
                              - y = 110
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "attributes_facebook"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to web"
                                      - type          = "equal_to"
                                      - value         = "web"
                                    },
                                ]
                              - event      = "match"
                              - next       = "attributes_web"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "attributes_facebook"
                      - properties  = {
                          - attributes = <<-EOT
                                {
                                  "name": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{widgets.ChatBot.memory | to_json}}
                                }
                            EOT
                          - channel    = "TCab0384ca345e91e804468b8e63e50261"
                          - offset     = {
                              - x = 90
                              - y = 400
                            }
                          - workflow   = "WWfd9eb357c72a412fb1853721f38c80b8"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                ]
            }
        ) -> (known after apply)
      ~ friendly_name = "Webchat Messaging Flow" -> "Webchat Studio Flow"
        id            = "FWaa65288300c8be6d41f00942a9532c66"
        # (2 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.chat has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["chat"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TC3d70bb1c3013fff22a5c05fcd330d46a"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.default has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["default"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TC6c40270bfedb3895b4a73f2ffb8a9369"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.email has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["email"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TC48fbf9d79e6cb298c08402800b8c878c"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.sms has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["sms"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TC90e27b63110d94f4198172af41fae93e"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.video has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["video"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TC74eb1c4dd20bd1f574aff161d51d6639"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.voice has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["voice"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WSfde7e37d78e8dcfc14308193b90e63e7/TCa1812bb67c738819c3f8f46582465411"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSfde7e37d78e8dcfc14308193b90e63e7"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.helpline_queue has moved to module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["master"]
    resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
        id                   = "WSfde7e37d78e8dcfc14308193b90e63e7/WQe1580a16e12409ddf642f0b5a61b852c"
        # (6 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  # (moved from module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.master_workflow)
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "channelType ==\"web\"  OR isContactlessTask == true OR  twilioNumber IN ['messenger:123236277715368']"
                          - filter_friendly_name = "Childline Zimbabwe"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQe1580a16e12409ddf642f0b5a61b852c"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WSfde7e37d78e8dcfc14308193b90e63e7/WW3718e0ead07d771e5e3ab23f8a389152"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQ278560f53ad61680dfd360a169c74d28"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WSfde7e37d78e8dcfc14308193b90e63e7/WWe8806e65585e53bf3ee172a8dc713032"
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 10 to change, 2 to destroy.